---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RasterLockProportions
source: html/b8529e31-b6da-203a-66a1-95b943586553.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RasterLockProportions Property

"Lock Proportions"

## Syntax (C#)
```csharp
public static ForgeTypeId RasterLockProportions { get; }
```